Core/src/src/DataProcessors/СинхронизацияЭлектронныхСФ/СинхронизацияЭлектронныхСФ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СинхронизацияЭлектронныхСФ</name>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокСФ</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>11</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>f_series</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>f_number</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Operation_DT</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Reg_DT</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Seller_UN_ID</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Buyer_UN_ID</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Status</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>K_ID</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>K_Type</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Tanxa</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Sa_Ident_No</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Org_Name</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Was_Ref</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.СтатусыСФ</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаОтказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СписокНакладных</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.СчетФактураПолученныйГрузия</types>
        <types>DocumentRef.СчетФактураОтправленныйГрузия</types>
      </type>
    </attributes>
    <attributes>
      <name>Флаг</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Состояние</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьОшибки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ФактураАванса</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДляФильтра</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТоварыНаПортале</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаАкциза</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>11</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Состояние</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыФактуры</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.СчетФактураПолученныйГрузия</types>
        <types>DocumentRef.СчетФактураОтправленныйГрузия</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Core/src/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <enumValues>
    <name>Запас</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>Работа</name>
  </enumValues>
  <enumValues>
    <name>Операция</name>
  </enumValues>
  <enumValues>
    <name>ВидРабот</name>
  </enumValues>
  <enumValues>
    <name>AzRyРасход</name>
  </enumValues>
  <enumValues>
    <name>Лицензия</name>
  </enumValues>
</mdclass:Enum>

Core/src/src/Documents/СчетФактураПолученныйГрузия/СчетФактураПолученныйГрузия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СчетФактураПолученныйГрузия</name>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <basedOn>Document.АвансовыйОтчет</basedOn>
  <basedOn>Document.ДополнительныеРасходы</basedOn>
  <basedOn>Document.ОтчетПереработчика</basedOn>
  <basedOn>Document.ОтчетКомиссионера</basedOn>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <basedOn>Document.РасходСоСчета</basedOn>
  <basedOn>Document.РасходИзКассы</basedOn>
  <registerRecords>AccumulationRegister.АвансыПолученныхФактур</registerRecords>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыПоНалогам</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Серия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСчетФактуры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыСФ</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Аванс</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНалога</name>
    <type>
      <types>CatalogRef.ВидыНалогов</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаКВозмещениюРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзмененаПользователем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.ПриходнаяНакладная</types>
        <types>DocumentRef.ОтчетПереработчика</types>
        <types>DocumentRef.Взаимозачет</types>
        <types>DocumentRef.ДополнительныеРасходы</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТоварыНаПортале</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаАкциза</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыПлатежа</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.РасходСоСчета</types>
        <types>DocumentRef.АвансовыйОтчет</types>
        <types>DocumentRef.РасходИзКассы</types>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/src/DataProcessors/СинхронизацияЭлектронныхСФ/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекДата		= ТекущаяДата();
	ДатаНач		= НачалоМесяца(ТекДата);
	ДатаКон		= КонецМесяца(ТекДата);
	Полученный	= Истина;
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Организация = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователи.ТекущийПользователь(),"ОсновнаяОрганизация");
		Если НЕ ЗначениеЗаполнено(Организация) Тогда
			Организация = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.Организации.ОсновнаяОрганизация");
		КонецЕсли;
	КонецЕсли;
	
	//+++ Lazare_19.05.2021
	Если ПолученныеСФ = 1 Тогда 
		Элементы.СоздатьНенайденныеНоменклатури.Видимость  = Истина ;
	Иначе
		Элементы.СоздатьНенайденныеНоменклатури.Видимость = Ложь;
	КонецЕсли;	
	Элементы.ПолученныеСФ.Видимость = Ложь ;	
	//--- Lazare_19.05.2021
	//Паганини#Nexia_
	Объект.ПериодРегистрации = НачалоМесяца(ТекущаяДата());
	ОтображениеПериодаРегистрации = Формат(Объект.ПериодРегистрации, "ДФ='MMMM yyyy'");
	УстановитьВидимостьДат();
	//_Паганини#Nexia
	
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда)
	ОчиститьСообщения();
	//}Paganini(LTB)_
	//Если НЕ ПроверитьЗаполнение() Тогда
	Если НЕ ФильтрЗаполнен() Тогда
	//}_Paganini(LTB)
		Возврат;
	КонецЕсли;
	ВыгрузитьНаСервере();
	КоличествоОтобранныхСтрок = Объект.СписокСФ.Количество();
	//Элементы.СписокСФ.ОтборСтрок = Неопределено;
	
	//+++ Lazare_19.05.2021	
	Элементы.СписокСФ.ОтборСтрок = Новый ФиксированнаяСтруктура(ПолучитьСтруктуруДялятбораСтрокПринятыхСФ()) ;
	Если КоличествоОтобранныхСтрок >0 Тогда 	
		Элементы.ПолученныеСФ.Видимость = Истина ;
	Иначе 
		Элементы.ПолученныеСФ.Видимость = Ложь ;
	КонецЕсли;
	//--- Lazare_19.05.2021
	
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьНаСервере()
	
	КонтрагентИНН = "";
	Если ЗначениеЗаполнено(Контрагент) Тогда
		КонтрагентИНН = СокрЛП(Контрагент.ИНН);
	КонецЕсли;
	//Паганини#Nexia_
	//Отборы = Новый Структура("S_DT, E_DT, Организация, КонтрагентИНН", ДатаНач, КонецДня(ДатаКон), Организация, КонтрагентИНН);
	Отборы = Новый Структура("Организация, КонтрагентИНН", Организация, КонтрагентИНН);
	Если ВариантФильтраВыгруки = 0 Тогда
		Отборы.Вставить("S_DT", ДатаНач);
		Отборы.Вставить("E_DT", КонецДня(ДатаКон));
	ИначеЕсли ВариантФильтраВыгруки = 1 Тогда
		Отборы.Вставить("op_s_dt", Объект.ПериодРегистрации);
		Отборы.Вставить("op_e_dt", КонецМесяца(Объект.ПериодРегистрации));
	Иначе
		Отборы.Вставить("S_DT", ДатаНач);
		Отборы.Вставить("E_DT", КонецДня(ДатаКон));
		Отборы.Вставить("op_s_dt", Объект.ПериодРегистрации);
		Отборы.Вставить("op_e_dt", КонецМесяца(Объект.ПериодРегистрации));
	КонецЕсли;
	//_Паганини#Nexia
	Объект.СписокСФ.Очистить();
	Объект.ТоварыНаПортале.Очистить();
	Объект.ДокументыФактуры.Очистить();	
	
	МассивФильтровСтатуса = Новый Массив;
	МассивФильтровСтатуса.Добавить(0);
	МассивФильтровСтатуса.Добавить(0);
	МассивФильтровСтатуса.Добавить(0);
	МассивФильтровСтатуса.Добавить(0);
	МассивФильтровСтатуса.Добавить(0);
	МассивФильтровСтатуса.Добавить(0);
	МассивФильтровСтатуса.Добавить(0);
	МассивФильтровСтатуса.Добавить(0);
	МассивФильтровСтатуса.Добавить(0);
	МассивФильтровСтатуса.Добавить(0);
	
	//Полученные
	Если Полученный Тогда
		СписокПринятыхФактур = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ПолучитьСписокПринятыхФактур(, Отборы);
		Если НЕ ТипЗнч(СписокПринятыхФактур) = Тип("Массив") Тогда
			Возврат;
		КонецЕсли;
		Для Каждого СтрокаТЗ ИЗ СписокПринятыхФактур Цикл
			НоваяЗапись = Объект.СписокСФ.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, СтрокаТЗ);
			//НоваяЗапись.Reg_DT		= ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СтрокаВДату(СтрокаТЗ.Reg_DT);
			//НоваяЗапись.OPeration_DT	= ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СтрокаВДату(СтрокаТЗ.OPeration_DT);
			НоваяЗапись.Статус      	= ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ПолучитьСтатусСФ_ИзЧисла(НоваяЗапись.Status);
			НоваяЗапись.СтатусДляФильтра= ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ПолучитьСтатусСФ_ДляФильтра(НоваяЗапись.Status, НоваяЗапись.Was_Ref);
			НоваяЗапись.Состояние       = "მიღებული";
			НоваяЗапись.ФактураАванса	= (Лев(НоваяЗапись.f_series, 2) = "ავ");
			
			//+++ Lazare_19.05.2021
			Если ЗначениеЗаполнено(НоваяЗапись.ПривязанныеТТН) Тогда 
				 НоваяЗапись.ДокументБезТТН = Ложь
				  //Элементы.СписокСФДокументБезТТН = Ложь ;			  
		 	Иначе 	
				  //Элементы.СписокСФДокументБезТТН = Истина ;
				  НоваяЗапись.ДокументБезТТН  = Истина ;
			КонецЕсли;
			//--- Lazare_19.05.2021
			
			ТоварыСФ = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ПолучитьТабЧастьФактуры(, Организация, НоваяЗапись.ID);
			Если Не ТоварыСФ = Неопределено Тогда
				Для Каждого СтрокаТЧRS Из ТоварыСФ Цикл
					СтрокаТовары = Объект.ТоварыНаПортале.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТовары, СтрокаТЧRS);
					СтрокаТовары.ID = НоваяЗапись.ID;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ЗаполнитьСписокФактур("მიღებული", Объект.СписокСФ, Организация);
		ПревязатьНакладныеКФактурам_Полученные();
	КонецЕсли;
	
	//Отправленные
	Если Отправленный Тогда
		СписокОтправленныхФактур = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ПолучитьСписокОтправленныхФактур(, Отборы);
		Если НЕ ТипЗнч(СписокОтправленныхФактур) = Тип("Массив") Тогда
			Возврат;
		КонецЕсли;
		Для Каждого СтрокаТЗ ИЗ СписокОтправленныхФактур Цикл
			НоваяЗапись = Объект.СписокСФ.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, СтрокаТЗ);
			//НоваяЗапись.Reg_DT		= ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СтрокаВДату(СтрокаТЗ.Reg_DT);
			//НоваяЗапись.OPeration_DT	= ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СтрокаВДату(СтрокаТЗ.OPeration_DT);
			НоваяЗапись.Статус      	= ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ПолучитьСтатусСФ_ИзЧисла(НоваяЗапись.Status);
			НоваяЗапись.СтатусДляФильтра= ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ПолучитьСтатусСФ_ДляФильтра(НоваяЗапись.Status, НоваяЗапись.Was_Ref);
			НоваяЗапись.Состояние       = "გაცემული";
			НоваяЗапись.ФактураАванса	= (Лев(НоваяЗапись.f_series, 2) = "ავ");
			
			// Kuzmich, 01.08.2023, ONESOFT-2450, Синхронизация СФ - создание расходная накладная на основе выданных счет фактуров
			Если ЗначениеЗаполнено(НоваяЗапись.ПривязанныеТТН) Тогда 
				НоваяЗапись.ДокументБезТТН = Ложь			  
			Иначе
				НоваяЗапись.ДокументБезТТН  = Истина ;
			КонецЕсли;
			// Kuzmich, 01.08.2023, ONESOFT-2450, Синхронизация СФ - создание расходная накладная на основе выданных счет фактуров
			
			ТоварыСФ = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ПолучитьТабЧастьФактуры(, Организация, НоваяЗапись.ID);
			Если Не ТоварыСФ = Неопределено Тогда
				Для Каждого СтрокаТЧRS Из ТоварыСФ Цикл
					СтрокаТовары = Объект.ТоварыНаПортале.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТовары, СтрокаТЧRS);
					СтрокаТовары.ID = НоваяЗапись.ID;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ЗаполнитьСписокФактур("გაცემული", Объект.СписокСФ, Организация);
		ПревязатьНакладныеКФактурам_Отправленные();
	КонецЕсли;
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ЗаполнитьСписок_КонтрагентовФактуры(Объект.СписокСФ);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокСФПриАктивизацииСтроки(Элемент)
	
	впТекущаяСтрока = Элементы.СписокСФ.ТекущиеДанные;
	Если впТекущаяСтрока <> Неопределено Тогда
		Элементы.ТоварыНаПортале.ОтборСтрок = Новый ФиксированнаяСтруктура("ID", впТекущаяСтрока.ID);
	Иначе 
		Элементы.ТоварыНаПортале.ОтборСтрок = Новый ФиксированнаяСтруктура("ID", "?????");
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура СоздатьСФ(Команда)
	ОчиститьСообщения();
	ЕстьОшибки = Ложь;
	Создать_Документы(ЕстьОшибки);
	Если НЕ ЕстьОшибки Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.ДокументыФактуры;		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура Создать_Документы(ЕстьОшибки)
	
	ДанныеЗаполненияСчетаФактурыПолученного = ДанныеЗаполненияСчетаФактурыПолученного(Организация, ТекущаяДата());
	ДанныеЗаполненияСчетаФактурыВыданного = ДанныеЗаполненияСчетаФактурыВыданного(Организация, ТекущаяДата());
	
	Если Не ПроверитьЗаполнениеУчетнойПолитики(ДанныеЗаполненияСчетаФактурыПолученного, ДанныеЗаполненияСчетаФактурыВыданного) Тогда
		ЕстьОшибки = Истина;
		Возврат;
	КонецЕсли;
	
	ПроверитьПередСозданиемДокументов(ЕстьОшибки);
	
	Созать_Полученныйе(ДанныеЗаполненияСчетаФактурыПолученного);
	Созать_Отправленные(ДанныеЗаполненияСчетаФактурыВыданного);
	
КонецПроцедуры

&НаСервере
Процедура Созать_Полученныйе(ДанныеЗаполнения)
	
	СписокВыбранныхСФ = Объект.СписокСФ.НайтиСтроки(Новый Структура("Флаг, Состояние, ЕстьОшибки", Истина, "მიღებული", Ложь));
	Для Каждого Запись ИЗ СписокВыбранныхСФ Цикл
		
		ДокПриходнаяНакладная = НЕОПРЕДЕЛЕНО;// Kuzmich, 03.08.2023, ONESOFT-2459, Синхронизация електронных СФ - Полученный - БезТТН - Автоматическое заполнение документа
		
		//+++ Lazare_19.05.2021
		Если ПолученныеСФ = 1 Тогда 
			ДокПриходнаяНакладная = Документы.ПриходнаяНакладная.СоздатьДокумент();
			
			//Шапка
			ДокПриходнаяНакладная.Заполнить(Неопределено);
			
			Если НачалоМесяца(Запись.Reg_DT) > НачалоМесяца(Запись.Operation_DT) Тогда 
				ДокПриходнаяНакладная.Дата  = НачалоДня(КонецМесяца(Запись.Operation_DT))  ;
			Иначе 
				ДокПриходнаяНакладная.Дата  = НачалоДня(Запись.Reg_DT)  ;
			КонецЕсли;	
			
			ДокПриходнаяНакладная.Дата         = Запись.Operation_DT ;
			ДокПриходнаяНакладная.Автор	       = ПараметрыСеанса.ТекущийПользователь.Ссылка;
			ДокПриходнаяНакладная.Организация  = Организация;
			ДокПриходнаяНакладная.Контрагент   = Запись.Контрагент;		
			Если ДокПриходнаяНакладная.Контрагент.ВестиРасчетыПоДоговорам Тогда 	
				ДокПриходнаяНакладная.Договор = ДокПриходнаяНакладная.Контрагент.ДоговорПоУмолчанию;
				ДанныеОКонтрагенте  = ДокПриходнаяНакладная.Договор ;
			Иначе 
				ДанныеОКонтрагенте  = ДокПриходнаяНакладная.Контрагент ;
			КонецЕсли;		
			ВалютаРасчетов     = ДанныеОКонтрагенте.ВалютаРасчетов ;
			НациональнаяВалюта = Константы.НациональнаяВалюта.Получить();
			
			СтруктураПоВалюте  = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ДокПриходнаяНакладная.Дата, Новый Структура("Валюта", НациональнаяВалюта));
			КурсНациональнаяВалюта      = СтруктураПоВалюте.Курс;
			КратностьНациональнаяВалюта = СтруктураПоВалюте.Кратность;
			
			СтруктураДанные      = ПолучитьДанныеДоговора(ДокПриходнаяНакладная.Дата, ВалютаРасчетов, ДанныеОКонтрагенте) ; 	
			СуммаВключаетНДС     = СтруктураДанные.СуммаВключаетНДС; ;
			УчетВалютныхОпераций = Константы.ФункциональнаяУчетВалютныхОпераций.Получить();
			НалогообложениеНДС   = СтруктураДанные.НалогообложениеСтавка.НалогообложениеНДС;
			Курс   = СтруктураДанные.ВалютаРасчетовКурсКратность.Курс ;
			ВидЦен = Неопределено ;
			
			ДокПриходнаяНакладная.ВалютаДокумента    = СтруктураДанные.ВалютаРасчетов ;
			ДокПриходнаяНакладная.Кратность          = СтруктураДанные.ВалютаРасчетовКурсКратность.Кратность ;
			ДокПриходнаяНакладная.Курс               = СтруктураДанные.ВалютаРасчетовКурсКратность.Курс;	
			ДокПриходнаяНакладная.НалогообложениеНДС = НалогообложениеНДС;
			ДокПриходнаяНакладная.ВидЦенКонтрагента  = СтруктураДанные.ВидЦенКонтрагента ;
			ДокПриходнаяНакладная.СуммаВключаетНДС   = СтруктураДанные.СуммаВключаетНДС ;				
			ДокПриходнаяНакладная.Подразделение      = Справочники.СтруктурныеЕдиницы.ОсновноеПодразделение ; 	
			ДокПриходнаяНакладная.IDСФ = Запись.ID;
			СерияСФ =  Запись.f_series;
			НомерСФ =  Запись.f_number;
			ДокПриходнаяНакладная.НомерСФ = СерияСФ + " " + НомерСФ ;		
			//Таб Часть Услуги
			УслугиНаПортале = Объект.ТоварыНаПортале.НайтиСтроки(Новый Структура("ID", Запись.ID));
			Для Каждого СтрокаТЗ Из УслугиНаПортале Цикл		
				НовСтрока =  ДокПриходнаяНакладная.Расходы.Добавить();			
				СоздатьНоменклатуру   			= СоздатьНенайденныеНоменклатури;
				НовСтрока.Номенклатура 			= ПолучитьНоменклатуру(СтрокаТЗ.Номенклатура,СоздатьНоменклатуру);
				НовСтрока.ЕдиницаИзмерения 		= ?(ЗначениеЗаполнено(НовСтрока.Номенклатура),НовСтрока.Номенклатура.ЕдиницаИзмерения,УправлениеНебольшойФирмойПовтИсп.ПолучитьПредопределенноеЗначениеСправочника("КлассификаторЕдиницИзмерения", "шт"));
				НовСтрока.Количество			= ?(СтрокаТЗ.Количество=0,1,СтрокаТЗ.Количество);
				НовСтрока.Сумма					= Окр((СтрокаТЗ.Сумма/ДокПриходнаяНакладная.Курс)* ДокПриходнаяНакладная.Кратность,2);
				НовСтрока.Цена			 	    = Окр(НовСтрока.Сумма/НовСтрока.Количество,2);
				Если СтрокаТЗ.СуммаНДС > 0 Тогда 
					НовСтрока.СуммаНДС		    = Окр((СтрокаТЗ.СуммаНДС/ДокПриходнаяНакладная.Курс)* ДокПриходнаяНакладная.Кратность,2);
					НовСтрока.СтавкаНДС        = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДС("НДС18");
				Иначе 
					НовСтрока.СуммаНДС 	    = СтрокаТЗ.СуммаНДС ;
					НовСтрока.СтавкаНДС        = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДС("НДС0");
				КонецЕсли;
				НовСтрока.ПроцентСкидкиНаценки	= 0;
				НовСтрока.СуммаБезНалогов	    = НовСтрока.Сумма - НовСтрока.СуммаНДС ;
				НовСтрока.Всего					= НовСтрока.Сумма;
				НовСтрока.СтруктурнаяЕдиница    = Справочники.СтруктурныеЕдиницы.ОсновноеПодразделение ; 		
			КонецЦикла;	
			Попытка
				ДокПриходнаяНакладная.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				ДокПриходнаяНакладная.Записать(РежимЗаписиДокумента.Запись);
			КонецПопытки;
		КонецЕсли;
		//--- Lazare_19.05.2021
		
		ДокументОбъект	= Документы.СчетФактураПолученныйГрузия.СоздатьДокумент();
		ДокументОбъект.Дата						= ТекущаяДата();
		ДокументОбъект.Автор					= ПараметрыСеанса.ТекущийПользователь.Ссылка;
		ДокументОбъект.Идентификатор			= Запись.ID;
		ДокументОбъект.ПериодРегистрации		= Запись.Reg_DT;
		ДокументОбъект.ДатаВходящегоДокумента	= Запись.Operation_DT;
		ДокументОбъект.Серия					= Запись.f_series;
		ДокументОбъект.НомерСчетФактуры			= Запись.f_number;
		ДокументОбъект.НомерВходящегоДокумента	= ДокументОбъект.Серия + " " + ДокументОбъект.НомерСчетФактуры;
		ДокументОбъект.Идентификатор			= Запись.ID;
		ДокументОбъект.Организация				= Организация;
		ДокументОбъект.Контрагент				= Запись.Контрагент;
		ДокументОбъект.Статус					= Запись.Статус;
		ДокументОбъект.Аванс					= Запись.ФактураАванса;
		
		ЗаполнитьЗначенияСвойств(ДокументОбъект, ДанныеЗаполнения);
		
		Если НЕ Запись.ФактураАванса Тогда
			//Документы
			Если ЗначениеЗаполнено(Запись.ПривязанныеТТН) Тогда
				ТаблицаНакладных = НайтиТТН_Полученной(Запись.ПривязанныеТТН);
				Для Каждого СтрокаТЗ ИЗ ТаблицаНакладных Цикл
					СтрокаДО = ДокументОбъект.ДокументыОснования.Добавить();
					СтрокаДО.ДокументОснование = СтрокаТЗ.ДокументОснование;
					СтруктураСумм = СуммыДокументаДляСчетФактурыПолученного(СтрокаДО.ДокументОснование);
					ЗаполнитьЗначенияСвойств(СтрокаДО, СтруктураСумм);		
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		//Товары
		ТоварыНаПортале = Объект.ТоварыНаПортале.НайтиСтроки(Новый Структура("ID", Запись.ID));
		Для Каждого СтрокаТЗ Из ТоварыНаПортале Цикл
			СтрокаТ = ДокументОбъект.ТоварыНаПортале.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТ, СтрокаТЗ);
		КонецЦикла;
		
		// Kuzmich, 03.08.2023, ONESOFT-2459, Синхронизация електронных СФ - Полученный - БезТТН - Автоматическое заполнение документа
		Если (ТипЗНЧ(ДокПриходнаяНакладная) = Тип("ДокументСсылка.ПриходнаяНакладная") ИЛИ ТипЗНЧ(ДокПриходнаяНакладная) = Тип("ДокументОбъект.ПриходнаяНакладная"))
			//И ДокПриходнаяНакладная.Проведен 
			Тогда
			
			НоваяСтрокаДокументыОснования = ДокументОбъект.ДокументыОснования.Добавить();
			
			НоваяСтрокаДокументыОснования.ДокументОснование = ДокПриходнаяНакладная.Ссылка;
			
			Если ДокПриходнаяНакладная.Проведен Тогда
				
				СтруктураСумм = РС_ОбщегоНазначения.ПолучитьСуммуИНДСДокументаВВалютеРасчета(ДокПриходнаяНакладная.Ссылка);
				
				НоваяСтрокаДокументыОснования.СуммаДокумента = СтруктураСумм.Сумма;
				НоваяСтрокаДокументыОснования.СуммаНДС = СтруктураСумм.СуммаНДС;
				НоваяСтрокаДокументыОснования.Всего = СтруктураСумм.СуммаВсего;
				
			КонецЕсли;
			
		КонецЕсли;
		// Kuzmich, 03.08.2023, ONESOFT-2459, Синхронизация електронных СФ - Полученный - БезТТН - Автоматическое заполнение документа
		
		Попытка
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			СтрокаДокФактуры = Объект.ДокументыФактуры.Добавить();
			СтрокаДокФактуры.Документ	= ДокументОбъект.Ссылка;
			Запись.Документ	= ДокументОбъект.Ссылка;
			Запись.Флаг		= Ложь;
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура Созать_Отправленные(ДанныеЗаполнения)
	
	СписокВыбранныхСФ = Объект.СписокСФ.НайтиСтроки(Новый Структура("Флаг, Состояние, ЕстьОшибки", Истина, "გაცემული", Ложь));
	Для Каждого Запись ИЗ СписокВыбранныхСФ Цикл
		
		// Kuzmich, 01.08.2023, ONESOFT-2450, Синхронизация СФ - создание расходная накладная на основе выданных счет фактуров
		ДокРасходнаяНакладная = НЕОПРЕДЕЛЕНО;
		
		Если ПолученныеСФ = 1 Тогда 
			
			ДокРасходнаяНакладная = Документы.РасходнаяНакладная.СоздатьДокумент();
			
			//Шапка
			ДокРасходнаяНакладная.Заполнить(Неопределено);
			
			ДокРасходнаяНакладная.Дата         = Запись.Operation_DT ;
			ДокРасходнаяНакладная.Автор	       = ПараметрыСеанса.ТекущийПользователь.Ссылка;
			ДокРасходнаяНакладная.Организация  = Организация;
			ДокРасходнаяНакладная.Контрагент   = Запись.Контрагент;		
			Если ДокРасходнаяНакладная.Контрагент.ВестиРасчетыПоДоговорам Тогда 	
				ДокРасходнаяНакладная.Договор = ДокРасходнаяНакладная.Контрагент.ДоговорПоУмолчанию;
				ДанныеОКонтрагенте  = ДокРасходнаяНакладная.Договор ;
			Иначе 
				ДанныеОКонтрагенте  = ДокРасходнаяНакладная.Контрагент ;
			КонецЕсли;		
			ВалютаРасчетов     = ДанныеОКонтрагенте.ВалютаРасчетов ;
			НациональнаяВалюта = Константы.НациональнаяВалюта.Получить();
			
			СтруктураПоВалюте  = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ДокРасходнаяНакладная.Дата, Новый Структура("Валюта", НациональнаяВалюта));
			КурсНациональнаяВалюта      = СтруктураПоВалюте.Курс;
			КратностьНациональнаяВалюта = СтруктураПоВалюте.Кратность;
			
			СтруктураДанные      = ПолучитьДанныеДоговора(ДокРасходнаяНакладная.Дата, ВалютаРасчетов, ДанныеОКонтрагенте) ; 	
			СуммаВключаетНДС     = СтруктураДанные.СуммаВключаетНДС; ;
			УчетВалютныхОпераций = Константы.ФункциональнаяУчетВалютныхОпераций.Получить();
			НалогообложениеНДС   = СтруктураДанные.НалогообложениеСтавка.НалогообложениеНДС;
			Курс   = СтруктураДанные.ВалютаРасчетовКурсКратность.Курс ;
			ВидЦен = Неопределено ;
			
			ДокРасходнаяНакладная.ВалютаДокумента    = СтруктураДанные.ВалютаРасчетов ;
			ДокРасходнаяНакладная.Кратность          = СтруктураДанные.ВалютаРасчетовКурсКратность.Кратность ;
			ДокРасходнаяНакладная.Курс               = СтруктураДанные.ВалютаРасчетовКурсКратность.Курс;	
			ДокРасходнаяНакладная.НалогообложениеНДС = НалогообложениеНДС;
			ДокРасходнаяНакладная.ВидЦен             = СтруктураДанные.ВидЦенКонтрагента ;
			ДокРасходнаяНакладная.СуммаВключаетНДС   = СтруктураДанные.СуммаВключаетНДС ;				
			ДокРасходнаяНакладная.Подразделение      = Справочники.СтруктурныеЕдиницы.ОсновноеПодразделение ; 	
			ДокРасходнаяНакладная.IDСФ = Запись.ID;
			СерияСФ =  Запись.f_series;
			НомерСФ =  Запись.f_number;
			ДокРасходнаяНакладная.НомерСФ = СерияСФ + " " + НомерСФ ;		
			//Таб Часть Услуги
			УслугиНаПортале = Объект.ТоварыНаПортале.НайтиСтроки(Новый Структура("ID", Запись.ID));
			Для Каждого СтрокаТЗ Из УслугиНаПортале Цикл		
				НовСтрока =  ДокРасходнаяНакладная.Запасы.Добавить();			
				СоздатьНоменклатуру   			= СоздатьНенайденныеНоменклатури;
				НовСтрока.Номенклатура 			= ПолучитьНоменклатуру(СтрокаТЗ.Номенклатура,СоздатьНоменклатуру);
				НовСтрока.ЕдиницаИзмерения 		= ?(ЗначениеЗаполнено(НовСтрока.Номенклатура),НовСтрока.Номенклатура.ЕдиницаИзмерения,УправлениеНебольшойФирмойПовтИсп.ПолучитьПредопределенноеЗначениеСправочника("КлассификаторЕдиницИзмерения", "шт"));
				НовСтрока.Количество			= ?(СтрокаТЗ.Количество=0,1,СтрокаТЗ.Количество);
				НовСтрока.Сумма					= Окр((СтрокаТЗ.Сумма/ДокРасходнаяНакладная.Курс)* ДокРасходнаяНакладная.Кратность,2);
				НовСтрока.Цена			 	    = Окр(НовСтрока.Сумма/НовСтрока.Количество,2);
				Если СтрокаТЗ.СуммаНДС > 0 Тогда 
					НовСтрока.СуммаНДС		    = Окр((СтрокаТЗ.СуммаНДС/ДокРасходнаяНакладная.Курс)* ДокРасходнаяНакладная.Кратность,2);
					НовСтрока.СтавкаНДС        = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДС("НДС18");
				Иначе 
					НовСтрока.СуммаНДС 	    = СтрокаТЗ.СуммаНДС ;
					НовСтрока.СтавкаНДС        = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДС("НДС0");
				КонецЕсли;
				НовСтрока.ПроцентСкидкиНаценки	= 0;
				НовСтрока.СуммаБезНалогов	    = НовСтрока.Сумма - НовСтрока.СуммаНДС ;
				НовСтрока.Всего					= НовСтрока.Сумма;
				НовСтрока.СтруктурнаяЕдиница    = Справочники.СтруктурныеЕдиницы.ОсновноеПодразделение ; 		
			КонецЦикла;	
			Попытка
				ДокРасходнаяНакладная.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				ДокРасходнаяНакладная.Записать(РежимЗаписиДокумента.Запись);
			КонецПопытки;
			
		КонецЕсли;
		// Kuzmich, 01.08.2023, ONESOFT-2450, Синхронизация СФ - создание расходная накладная на основе выданных счет фактуров
		
		ДокументОбъект	= Документы.СчетФактураОтправленныйГрузия.СоздатьДокумент();
		ДокументОбъект.Дата						= ТекущаяДата();
		ДокументОбъект.Автор					= ПараметрыСеанса.ТекущийПользователь.Ссылка;
		ДокументОбъект.Идентификатор			= Запись.ID;
		ДокументОбъект.ПериодРегистрации		= Запись.Reg_DT;
		ДокументОбъект.ДатаВходящегоДокумента	= Запись.Operation_DT;
		ДокументОбъект.Серия					= Запись.f_series;
		ДокументОбъект.НомерСчетФактуры			= Запись.f_number;
		ДокументОбъект.НомерВходящегоДокумента	= ДокументОбъект.Серия + " " + ДокументОбъект.НомерСчетФактуры;
		ДокументОбъект.Идентификатор			= Запись.ID;
		ДокументОбъект.Организация				= Организация;
		ДокументОбъект.Контрагент				= Запись.Контрагент;
		ДокументОбъект.Статус					= Запись.Статус;
		ДокументОбъект.Аванс					= Запись.ФактураАванса;
		
		ЗаполнитьЗначенияСвойств(ДокументОбъект, ДанныеЗаполнения);
		
		Если НЕ Запись.ФактураАванса Тогда
			//Документы
			ТаблицаНакладных = Неопределено;
			Если ЗначениеЗаполнено(Запись.ПривязанныеТТН) Тогда
				ТаблицаНакладных = НайтиТТН_Отправленные(Запись.ПривязанныеТТН);
				Для Каждого СтрокаТЗ ИЗ ТаблицаНакладных Цикл
					СтрокаДО = ДокументОбъект.ДокументыОснования.Добавить();
					СтрокаДО.ДокументОснование = СтрокаТЗ.ДокументОснование;
					СтруктураСумм = СуммыДокументаДляСчетФактурыОтправленного(СтрокаДО.ДокументОснование);
					ЗаполнитьЗначенияСвойств(СтрокаДО, СтруктураСумм);
				КонецЦикла;
			КонецЕсли;
			
			//Запасы
			Если НЕ ТаблицаНакладных = Неопределено Тогда
				ДокументОбъект.ЗаполнитьЗапасы(ТаблицаНакладных.ВыгрузитьКолонку("ДокументОснование"));
			КонецЕсли;
		КонецЕсли;
		
		// Kuzmich, 01.08.2023, ONESOFT-2450, Синхронизация СФ - создание расходная накладная на основе выданных счет фактуров
		Если (ТипЗНЧ(ДокРасходнаяНакладная) = Тип("ДокументСсылка.РасходнаяНакладная") ИЛИ ТипЗНЧ(ДокРасходнаяНакладная) = Тип("ДокументОбъект.РасходнаяНакладная"))
			//И ДокРасходнаяНакладная.Проведен 
			Тогда
			
			НоваяСтрокаДокументыОснования = ДокументОбъект.ДокументыОснования.Добавить();
			
			НоваяСтрокаДокументыОснования.ДокументОснование	= ДокРасходнаяНакладная.Ссылка;
			НоваяСтрокаДокументыОснования.Всего = ДокРасходнаяНакладная.Запасы.Итог("Всего");
			НоваяСтрокаДокументыОснования.СуммаНДС = ДокРасходнаяНакладная.Запасы.Итог("СуммаНДС");
			НоваяСтрокаДокументыОснования.СуммаДокумента = НоваяСтрокаДокументыОснования.Всего - НоваяСтрокаДокументыОснования.СуммаНДС;
			Если ДокРасходнаяНакладная.СтоимостьДоставки > 0 Тогда 
				НоваяСтрокаДокументыОснования.Всего = НоваяСтрокаДокументыОснования.Всего + ДокРасходнаяНакладная.СтоимостьДоставки ;
				НоваяСтрокаДокументыОснования.СуммаНДС = НоваяСтрокаДокументыОснования.СуммаНДС + ДокРасходнаяНакладная.СуммаНДСДоставки ;
				НоваяСтрокаДокументыОснования.СуммаДокумента = НоваяСтрокаДокументыОснования.СуммаДокумента +(ДокРасходнаяНакладная.СтоимостьДоставки - ДокРасходнаяНакладная.СуммаНДСДоставки);
			КонецЕсли;			
			
		КонецЕсли;
		
		// Заполняем товары/услуги
		МассивДокументыОснования = Новый Массив;
		Для Каждого СтрокаТЧ Из ДокументОбъект.ДокументыОснования Цикл
			Если ТипЗнч(СтрокаТЧ.ДокументОснование) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
				Продолжить;
			КонецЕсли;
			МассивДокументыОснования.Добавить(СтрокаТЧ.ДокументОснование);	
		КонецЦикла;
		ДокументОбъект.ЗаполнитьЗапасы(МассивДокументыОснования);
		// Kuzmich, 01.08.2023, ONESOFT-2450, Синхронизация СФ - создание расходная накладная на основе выданных счет фактуров
		
		Попытка
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			СтрокаДокФактуры = Объект.ДокументыФактуры.Добавить();
			СтрокаДокФактуры.Документ	= ДокументОбъект.Ссылка;
			Запись.Документ	= ДокументОбъект.Ссылка;
			Запись.Флаг		= Ложь;
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПревязатьНакладныеКФактурам_Полученные()
	
	УстановитьПривилегированныйРежим(Истина);
	Для Каждого СтрокаСФ ИЗ Объект.СписокСФ Цикл
		Если ЗначениеЗаполнено(СтрокаСФ.Документ) Тогда
            ПерваяСтрока		  = Истина;
			ЕстьИзминении		  = Ложь;
			ЕстьИзминенииВСтатусе = Ложь;
			Если НЕ СтрокаСФ.Статус = СтрокаСФ.Документ.Статус Тогда
				ЕстьИзминенииВСтатусе = Истина;
			КонецЕсли;
			ТаблицаНакладных = НайтиТТН_Полученной(СтрокаСФ.ПривязанныеТТН);
			Для Каждого СтрокаПН ИЗ ТаблицаНакладных Цикл
				НайденныеСтроки = СтрокаСФ.Документ.ДокументыОснования.НайтиСтроки(Новый Структура("ДокументОснование", СтрокаПН.ДокументОснование));
				Если НайденныеСтроки.Количество() = 0 Тогда
					Если ПерваяСтрока Тогда
						ДокументСф = СтрокаСФ.Документ.ПолучитьОбъект();
						ПерваяСтрока	= Ложь;
						ЕстьИзминении	= Истина;
					КонецЕсли;
					СтрокаДО = ДокументСф.ДокументыОснования.Добавить();
					СтрокаДО.ДокументОснование = СтрокаПН.ДокументОснование;
					СтруктураСумм = СуммыДокументаДляСчетФактурыПолученного(СтрокаДО.ДокументОснование);
					ЗаполнитьЗначенияСвойств(СтрокаДО, СтруктураСумм);
				КонецЕсли;
			КонецЦикла;
			Если ЕстьИзминении Тогда
				ДокументСф.ТоварыНаПортале.Очистить();
				ТоварыНаПортале = Объект.ТоварыНаПортале.НайтиСтроки(Новый Структура("ID", СтрокаСФ.ID));
				Для Каждого СтрокаТЗ Из ТоварыНаПортале Цикл
					СтрокаТ = ДокументСф.ТоварыНаПортале.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТ, СтрокаТЗ);
				КонецЦикла;
				Если ЕстьИзминенииВСтатусе Тогда
					ДокументСф.Статус = СтрокаСФ.Статус;
				КонецЕсли;
				ДокументСф.Записать();
			ИначеЕсли ЕстьИзминенииВСтатусе Тогда
				ДокументСф = СтрокаСФ.Документ.ПолучитьОбъект();
				ДокументСф.Статус = СтрокаСФ.Статус;
				ДокументСф.Записать();
			КонецЕсли;			
		КонецЕсли;
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры
&НаСервере
Процедура ПревязатьНакладныеКФактурам_Отправленные()
	
	УстановитьПривилегированныйРежим(Истина);
	Для Каждого СтрокаСФ ИЗ Объект.СписокСФ Цикл
		Если ЗначениеЗаполнено(СтрокаСФ.Документ) Тогда
            ПерваяСтрока		  = Истина;
			ЕстьИзминении		  = Ложь;
			ЕстьИзминенииВСтатусе = Ложь;
			Если НЕ СтрокаСФ.Статус = СтрокаСФ.Документ.Статус Тогда
				ЕстьИзминенииВСтатусе = Истина;
			КонецЕсли;
			ТаблицаНакладных = НайтиТТН_Полученной(СтрокаСФ.ПривязанныеТТН);
			Для Каждого СтрокаПН ИЗ ТаблицаНакладных Цикл
				НайденныеСтроки = СтрокаСФ.Документ.ДокументыОснования.НайтиСтроки(Новый Структура("ДокументОснование", СтрокаПН.ДокументОснование));
				Если НайденныеСтроки.Количество() = 0 Тогда
					Если ПерваяСтрока Тогда
						ДокументСф = СтрокаСФ.Документ.ПолучитьОбъект();
						ПерваяСтрока	= Ложь;
						ЕстьИзминении	= Истина;
					КонецЕсли;
					СтрокаДО = ДокументСф.ДокументыОснования.Добавить();
					СтрокаДО.ДокументОснование = СтрокаПН.ДокументОснование;
					СтруктураСумм = СуммыДокументаДляСчетФактурыОтправленного(СтрокаДО.ДокументОснование);
					ЗаполнитьЗначенияСвойств(СтрокаДО, СтруктураСумм);
				КонецЕсли;
			КонецЦикла;
			Если ЕстьИзминении Тогда
				ДокументСф.ТоварыНаПортале.Очистить();
				ТоварыНаПортале = Объект.ТоварыНаПортале.НайтиСтроки(Новый Структура("ID", СтрокаСФ.ID));
				Для Каждого СтрокаТЗ Из ТоварыНаПортале Цикл
					СтрокаТ = ДокументСф.ТоварыНаПортале.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТ, СтрокаТЗ);
				КонецЦикла;
				Если ЕстьИзминенииВСтатусе Тогда
					ДокументСф.Статус = СтрокаСФ.Статус;
				КонецЕсли;
				ДокументСф.ОбменДанными.Загрузка = Истина;
				ДокументСф.Записать();
			ИначеЕсли ЕстьИзминенииВСтатусе Тогда
				ДокументСф = СтрокаСФ.Документ.ПолучитьОбъект();
				ДокументСф.Статус = СтрокаСФ.Статус;
				ДокументСф.ОбменДанными.Загрузка = Истина;
				ДокументСф.Записать();
			КонецЕсли;			
		КонецЕсли;
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры



&НаСервереБезКонтекста
Функция НайтиТТН_Полученной(НомераНакладных)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриходнаяНакладная.Ссылка КАК ДокументОснование,
		|	ПриходнаяНакладная.НомерТТН
		|ИЗ
		|	Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
		|ГДЕ
		|	НЕ ПриходнаяНакладная.НомерТТН = """"
		|	И ПриходнаяНакладная.НомерТТН В(&НомераНакладных)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РасходнаяНакладная.Ссылка,
		|	РасходнаяНакладная.НомерТТН
		|ИЗ
		|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
		|ГДЕ
		|	НЕ РасходнаяНакладная.НомерТТН = """"
		|	И РасходнаяНакладная.НомерТТН В(&НомераНакладных)
		|	И РасходнаяНакладная.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику)";
	Запрос.УстановитьПараметр("НомераНакладных", НомераНакладных);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
&НаСервереБезКонтекста
Функция НайтиТТН_Отправленные(НомераНакладных)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходнаяНакладная.Ссылка КАК ДокументОснование,
		|	РасходнаяНакладная.НомерТТН
		|ИЗ
		|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
		|ГДЕ
		|	НЕ РасходнаяНакладная.НомерТТН = """"
		|	И РасходнаяНакладная.НомерТТН В(&НомераНакладных)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПриходнаяНакладная.Ссылка,
		|	ПриходнаяНакладная.НомерТТН
		|ИЗ
		|	Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
		|ГДЕ
		|	НЕ ПриходнаяНакладная.НомерТТН = """"
		|	И ПриходнаяНакладная.НомерТТН В(&НомераНакладных)
		|	И ПриходнаяНакладная.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя)";
	Запрос.УстановитьПараметр("НомераНакладных", НомераНакладных);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервереБезКонтекста
Функция СуммыДокументаДляСчетФактурыПолученного(ДокументСсылка)

	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ДополнительныеРасходы") Тогда
		СуммаНДСДокумент = ДокументСсылка.Расходы.Итог("СуммаНДС");
	Иначе
		СуммаНДСДокумент = ДокументСсылка.Запасы.Итог("СуммаНДС") + ?(ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ПриходнаяНакладная"), ДокументСсылка.Расходы.Итог("СуммаНДС"), 0);
	КонецЕсли;
	СуммаВсего 			= ДокументСсылка.СуммаДокумента;
	//_lazare
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
		СуммаДокумент		= СуммаВсего;
	Иначе
	//lazare_
		СуммаДокумент		= СуммаВсего - СуммаНДСДокумент;
	КонецЕсли;
	
	// Олег Литвиненко 17.11.22 --->
	//Для РасходнаяНакладная суммы должны быть отрицательные
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		СуммаДокумент = ?(СуммаВсего>0, -СуммаВсего, СуммаВсего);
		СуммаНДСДокумент = ?(СуммаНДСДокумент>0, -СуммаНДСДокумент,СуммаНДСДокумент);
		СуммаВсего = ?(СуммаВсего>0, -СуммаВсего, СуммаВсего);
	КонецЕсли;
	// Олег Литвиненко <---
	
	Возврат Новый Структура("СуммаДокумента, СуммаНДС, Всего", СуммаДокумент, СуммаНДСДокумент, СуммаВсего);
	
КонецФункции

&НаСервереБезКонтекста
Функция СуммыДокументаДляСчетФактурыОтправленного(ДокументСсылка)

	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ДополнительныеРасходы") Тогда
		СуммаНДСДокумент = ДокументСсылка.Расходы.Итог("СуммаНДС");
	Иначе
		СуммаНДСДокумент = ДокументСсылка.Запасы.Итог("СуммаНДС")
			+ ?(ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ПриходнаяНакладная"), ДокументСсылка.Расходы.Итог("СуммаНДС"), 0);
	КонецЕсли;
	
	СуммаВсего = ДокументСсылка.СуммаДокумента;
	СуммаДокумент = СуммаВсего - СуммаНДСДокумент;
	
	//Для документа-основания вида ПриходнаяНакладная суммы должны быть отрицательные.
	
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
		СуммаДокумент = ?(СуммаВсего > 0, -СуммаВсего, СуммаВсего);
		СуммаНДСДокумент = ?(СуммаНДСДокумент > 0, -СуммаНДСДокумент, СуммаНДСДокумент);
		СуммаВсего = ?(СуммаВсего > 0, -СуммаВсего, СуммаВсего);
	КонецЕсли;
	
	Возврат Новый Структура("СуммаДокумента, СуммаНДС, Всего", СуммаДокумент, СуммаНДСДокумент, СуммаВсего);
	
КонецФункции

&НаСервере
Процедура ПроверитьПередСозданиемДокументов(ЕстьОшибки)
	
	ОтмеченныеСтроки = Объект.СписокСФ.НайтиСтроки(Новый Структура("Флаг", Истина));
	Для Каждого СтрокаСФ Из ОтмеченныеСтроки Цикл
		Если Не ЗначениеЗаполнено(СтрокаСФ.Контрагент) Тогда 
			Сообщение = Новый СообщениеПользователю;
			пНомерСтроки = Формат(СтрокаСФ.НомерСтроки-1, "ЧГ=0");
			Сообщение.Текст = "სტრიქონში ნომერი " + Формат(СтрокаСФ.НомерСтроки, "ЧГ=0") + " ფაქტურისთვი " +Формат(СтрокаСФ.ID, "ЧГ=0")+ " არ არის შევსებული კონტრაგენტი";
			Сообщение.Поле =  "Объект.СписокСФ[" + пНомерСтроки + "].Контрагент";
			Сообщение.УстановитьДанные(Объект);
			Сообщение.Сообщить();
			СтрокаСФ.ЕстьОшибки = Истина;
			ЕстьОшибки = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

//++lyskov 19.02.2023
&НаСервере
Функция ПроверитьЗаполнениеУчетнойПолитики(ПоляСчетФактурыПолученного, ПоляСчетФактурыВыданного)
	
	Отказ = Ложь;
	
	Если Не ЗначениеЗаполнено(ПоляСчетФактурыПолученного.ВидНалога) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Не заполнен ""Вид налога"" для счета-фактуры полученного на вкладке ""Создание номенклатуры"" в учетной политике';
				|ka = 'არ არის შევსებული ""გადასახადის ტიპი"" ფაქტურისთვის (მიღებული) ჩანართზე ""ნომენკლატურის შექმნა"" აღრიცხვის პოლიტიკაში'"), ,
			"Организация", ,
			Отказ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПоляСчетФактурыПолученного.СчетУчетаКВозмещениюРегл) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Не заполнен ""Счет к возмещению (регл)"" для счета-фактуры полученного на вкладке ""Создание номенклатуры"" в учетной политике';
				|ka = 'არ არის შევსებული ""აღრიცხვის ანგარიში"" ფაქტურისთვის (მიღებული) ჩანართზე ""ნომენკლატურის შექმნა"" აღრიცხვის პოლიტიკაში'"), ,
			"Организация", ,
			Отказ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПоляСчетФактурыВыданного.ВидНалога) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Не заполнен ""Вид налога"" для счета-фактуры отправленного на вкладке ""Создание номенклатуры"" в учетной политике';
				|ka = 'არ არის შევსებული ""გადასახადის ტიპი"" ფაქტურისთვის (გაგზავნილი) ჩანართზე ""ნომენკლატურის შექმნა"" აღრიცხვის პოლიტიკაში'"), ,
			"Организация", ,
			Отказ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПоляСчетФактурыВыданного.СчетУчетаРегл) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Не заполнен ""Счет учета (регл)"" для счета-фактуры отправленного на вкладке ""Создание номенклатуры"" в учетной политике';
				|ka = 'არ არის შევსებული ""აღრიცხვის ანგარიში"" ფაქტურისთვის (გაგზავნილი) ჩანართზე ""ნომენკლატურის შექმნა"" აღრიცხვის პოლიტიკაში'"), ,
			"Организация", ,
			Отказ);
	КонецЕсли;
	
	Возврат Не Отказ;
	
КонецФункции


&НаКлиенте
Процедура СнятьФлажки(Команда)
	УстановитьСнятьФлажки(Ложь);
КонецПроцедуры
&НаКлиенте
Процедура УстановитьФлажки(Команда)
	УстановитьСнятьФлажки(Истина);
КонецПроцедуры
&НаСервере
Процедура УстановитьСнятьФлажки(знч_Загружать)
	Если знч_Загружать Тогда
		Для Каждого Стр Из Объект.СписокСФ Цикл
			Если НЕ ЗначениеЗаполнено(Стр.Документ) Тогда
				//Стр.Флаг = знч_Загружать;
				
				// Олег Литвиненко 27.04.23 --->
				// Задача от Levan Romanadze
				Если ПолученныеСФ=1 Тогда
					Если Стр.ДокументБезТТН Тогда
						Стр.Флаг = знч_Загружать;
					КонецЕсли;
				Иначе
				    Стр.Флаг = знч_Загружать;
				КонецЕсли;
				// Олег Литвиненко <---
				
			КонецЕсли;
			//ПолученныеСФ
		КонецЦикла;
	Иначе
		Для Каждого Стр Из Объект.СписокСФ Цикл 
			Стр.Флаг = знч_Загружать;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры




&НаКлиенте
Процедура Все(Команда)
	Элементы.СписокСФ.ОтборСтрок = Неопределено;
	СписокСФПриАктивизацииСтроки(Неопределено);
	КоличествоОтобранныхСтрок = Объект.СписокСФ.Количество();
КонецПроцедуры
&НаКлиенте
Процедура КОтправке(Команда)
	УстановитьОтборСтрок(0);
КонецПроцедуры
&НаКлиенте
Процедура Отклонен(Команда)
	УстановитьОтборСтрок(10);
КонецПроцедуры
&НаКлиенте
Процедура Отправленная(Команда)
	УстановитьОтборСтрок(1);
КонецПроцедуры
&НаКлиенте
Процедура Подтвержденная(Команда)
	УстановитьОтборСтрок(2);
КонецПроцедуры
&НаКлиенте
Процедура Отмененная(Команда)
	УстановитьОтборСтрок(67);
КонецПроцедуры
&НаКлиенте
Процедура Первичная(Команда)
	УстановитьОтборСтрок(3);
КонецПроцедуры
&НаКлиенте
Процедура Коректированный(Команда)
	УстановитьОтборСтрок(458);
КонецПроцедуры
&НаКлиенте
Процедура Замененная(Команда)
	УстановитьОтборСтрок(9);
КонецПроцедуры
&НаКлиенте
Процедура Удаленный(Команда)
	УстановитьОтборСтрок(-1);
КонецПроцедуры


&НаКлиенте
Процедура УстановитьОтборСтрок(ОтборПоСтрокеОтбора)
	
	Элементы.СписокСФ.ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("СтатусДляФильтра", ОтборПоСтрокеОтбора));
	СписокСФПриАктивизацииСтроки(Неопределено);
	КоличествоОтобранныхСтрок = Объект.СписокСФ.НайтиСтроки(Новый Структура("СтатусДляФильтра", ОтборПоСтрокеОтбора)).Количество();
	
КонецПроцедуры

//++lazare
&НаКлиенте
Процедура ПолученныеСФПриИзменении(Элемент)
		
	Элементы.СписокСФ.ОтборСтрок = Новый ФиксированнаяСтруктура(ПолучитьСтруктуруДялятбораСтрокПринятыхСФ()) ;
	Если ПолученныеСФ = 1 Тогда 
		Элементы.СоздатьНенайденныеНоменклатури.Видимость = Истина ;	
	Иначе   
		Элементы.СоздатьНенайденныеНоменклатури.Видимость = Ложь ;	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруДялятбораСтрокПринятыхСФ()

	СтруктураОтбора =  Новый Структура();	
	Если ПолученныеСФ = 1 Тогда 
		СтруктураОтбора.Вставить("ДокументБезТТН",Истина);
 	КонецЕсли;
		
	Возврат СтруктураОтбора;

КонецФункции

&НаСервере
Функция ПолучитьНоменклатуру(Номенклатура,СоздатьНоменклатуру)

	Если Не СоздатьНоменклатуру Тогда 
		НайденнаяНоменклатура = Справочники.Номенклатура.НайтиПоНаименованию(Номенклатура,Истина);
	Иначе 
		НайденнаяНоменклатура = Справочники.Номенклатура.НайтиПоНаименованию(Номенклатура,Истина);
		Если НайденнаяНоменклатура = Справочники.Номенклатура.ПустаяСсылка() Тогда 
			 НайденнаяНоменклатура =  СоздатНоменклатуру(Номенклатура);
		КонецЕсли;
	КонецЕсли;
			
	Возврат НайденнаяНоменклатура;

КонецФункции 

&НаСервере
Функция  СоздатНоменклатуру(Номенклатура)
	
	ЗначенияЗаполнения = РегистрыСведений.УчетнаяПолитикаРегл.ЗначенияПолейУчетнойПолитики(
		"НаправлениеДеятелности,СчетУчетаЗатратРегл,ЕдиницИзмерения",
		Организация,
		ТекущаяДатаСеанса());
	
	СтруктураПараметров = Новый Структура;
	
	Если ЗначениеЗаполнено(ЗначенияЗаполнения.ЕдиницИзмерения)Тогда
		 СтруктураПараметров.Вставить("ЕдиницИзмерения", ЗначенияЗаполнения.ЕдиницИзмерения);
	Иначе 
		 СтруктураПараметров.Вставить("ЕдиницИзмерения", УправлениеНебольшойФирмойПовтИсп.ПолучитьПредопределенноеЗначениеСправочника("КлассификаторЕдиницИзмерения", "шт"));
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ЗначенияЗаполнения.СчетУчетаЗатратРегл)Тогда
		 СтруктураПараметров.Вставить("СчетУчетаЗатратРегл", ЗначенияЗаполнения.СчетУчетаЗатратРегл);
	Иначе 
		 СтруктураПараметров.Вставить("СчетУчетаЗатратРегл", ПланыСчетов.Хозрасчетный.НайтиПоКоду("1630"));
	КонецЕсли;	
	СтруктураПараметров.Вставить("Услуга",				Перечисления.ТипыНоменклатуры.Услуга);
	СтруктураПараметров.Вставить("БезКатегории",		УправлениеНебольшойФирмойПовтИсп.ПолучитьПредопределенноеЗначениеСправочника("КатегорииНоменклатуры", 	"БезКатегории"));	
	Если ЗначениеЗаполнено(ЗначенияЗаполнения.НаправлениеДеятелности)Тогда
		 СтруктураПараметров.Вставить("НаправлениеДеятелности", ЗначенияЗаполнения.НаправлениеДеятелности);
	Иначе 
		 СтруктураПараметров.Вставить("НаправлениеДеятелности",	УправлениеНебольшойФирмойПовтИсп.ПолучитьПредопределенноеЗначениеСправочника("НаправленияДеятельности", "ОсновноеНаправление"));
	КонецЕсли;	
	СтруктураПараметров.Вставить("Наименование",Номенклатура);
	
	
	НовНоменклатура = Справочники.Номенклатура.СоздатьЭлемент();
	НовНоменклатура.Заполнить(Неопределено);
	НовНоменклатура.СчетУчетаЗатратРегл     = СтруктураПараметров.СчетУчетаЗатратРегл;	
	НовНоменклатура.Наименование 		    = СтруктураПараметров.Наименование;
	НовНоменклатура.НаименованиеПолное      = СтруктураПараметров.Наименование;
	НовНоменклатура.ТипНоменклатуры 	    = СтруктураПараметров.Услуга;
	НовНоменклатура.ЕдиницаИзмерения        = СтруктураПараметров.ЕдиницИзмерения;
	НовНоменклатура.КатегорияНоменклатуры   = СтруктураПараметров.БезКатегории;                                                                       
	НовНоменклатура.НаправлениеДеятельности = СтруктураПараметров.НаправлениеДеятелности;				
	НовНоменклатура.Записать();		
	Ссылка = НовНоменклатура.Ссылка;

	Возврат Ссылка ;
КонецФункции

&НаСервере
Функция ПолучитьДанныеДоговора(Дата, ВалютаДокумента, Договор)
	
	СтруктураДанные = Новый Структура;
	
	СтруктураДанные.Вставить(
		"ВалютаРасчетов",
		Договор.ВалютаРасчетов
	);
	
	СтруктураДанные.Вставить(
		"ВалютаРасчетовКурсКратность",
		РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Дата, Новый Структура("Валюта", Договор.ВалютаРасчетов))
	);
	
	СтруктураДанные.Вставить(
		"РасчетыВУсловныхЕдиницах",
	  	Договор.РасчетыВУсловныхЕдиницах
	);
	
	СтруктураДанные.Вставить(
		"ВидЦенКонтрагента",
		Договор.ВидЦенКонтрагента
	);
	
	СтруктураДанные.Вставить(
		"СуммаВключаетНДС",
		?(ЗначениеЗаполнено(Договор.ВидЦенКонтрагента), Договор.ВидЦенКонтрагента.ЦенаВключаетНДС, Неопределено)
	);
	
	СтруктураДанные.Вставить(
		"УчетЦенКонтрагентов",
		ПолучитьФункциональнуюОпцию("УчетЦенКонтрагентов")
	);
	
	Если ПолучитьФункциональнуюОпцию("ФункциональнаяОпцияИспользоватьИсториюНалогообложенияКонтрагентов") Тогда
		СтруктураДанные.Вставить(
			"НалогообложениеСтавка",
			РегистрыСведений.НалогообложениеКонтрагентов.ПолучитьПоследнее(Дата, Новый Структура("Контрагент,Договор", Договор.Владелец, Договор))
			);
	Иначе
		СтруктураДанные.Вставить(
			"НалогообложениеСтавка", Новый Структура("НалогообложениеНДС",Договор.Владелец.НалогообложениеНДС));
	КонецЕсли;	
	
	СтруктураДанные.Вставить(
		"ВидЦен",
		Договор.ВидЦен);
	
	Возврат СтруктураДанные;
	
КонецФункции 

//++lyskov 19.02.2023
&НаСервереБезКонтекста
Функция ДанныеЗаполненияСчетаФактурыПолученного(Организация, ДатаСведений)
	
	ДанныеЗаполнения = Новый Структура;
	
	ДанныеУчетнойПолитики = РегистрыСведений.УчетнаяПолитикаРегл.ЗначенияПолейУчетнойПолитики(
		"СчетФактураПолученныйВидНалогаПриСинхронизации,СчетФактураПолученныйСчетУчетаПриСинхронизации",
		Организация,
		ДатаСведений);
	
	ДанныеЗаполнения.Вставить("ВидНалога", ДанныеУчетнойПолитики.СчетФактураПолученныйВидНалогаПриСинхронизации);
	ДанныеЗаполнения.Вставить("СчетУчетаКВозмещениюРегл", ДанныеУчетнойПолитики.СчетФактураПолученныйСчетУчетаПриСинхронизации);
	
	Возврат ДанныеЗаполнения;
	
КонецФункции

//++lyskov 19.02.2023
&НаСервереБезКонтекста
Функция ДанныеЗаполненияСчетаФактурыВыданного(Организация, ДатаСведений)
	
	ДанныеЗаполнения = Новый Структура;
	
	ДанныеУчетнойПолитики = РегистрыСведений.УчетнаяПолитикаРегл.ЗначенияПолейУчетнойПолитики(
		"СчетФактураВыданныйВидНалогаПриСинхронизации,СчетФактураВыданныйСчетУчетаПриСинхронизации",
		Организация,
		ДатаСведений);
	
	ДанныеЗаполнения.Вставить("ВидНалога", ДанныеУчетнойПолитики.СчетФактураВыданныйВидНалогаПриСинхронизации);
	ДанныеЗаполнения.Вставить("СчетУчетаРегл", ДанныеУчетнойПолитики.СчетФактураВыданныйСчетУчетаПриСинхронизации);
	
	Возврат ДанныеЗаполнения;
	
КонецФункции

//Паганини#Nexia_
&НаКлиенте
Процедура ПериодРегистрацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка	 = Ложь;
	ДатаКалендаряПриОткрытии = ?(ЗначениеЗаполнено(Объект.ПериодРегистрации), Объект.ПериодРегистрации, УправлениеНебольшойФирмойПовтИсп.ПолучитьТекущуюДатаСеанса());
	ОткрытьФорму("ОбщаяФорма.ФормаКалендаря", УправлениеНебольшойФирмойКлиент.ПолучитьПараметрыОткрытияФормыКалендаря(ДатаКалендаряПриОткрытии), ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	УправлениеНебольшойФирмойКлиент.ПриРегулированииПериодаРегистрации(ЭтаФорма, Направление);
	УправлениеНебольшойФирмойКлиент.ПриИзмененииПериодаРегистрации(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ИсточникВыбора) = Тип("УправляемаяФорма")
		И СтрНайти(ИсточникВыбора.ИмяФормы, "ФормаКалендаря") > 0 Тогда
		
		Объект.ПериодРегистрации = КонецДня(ВыбранноеЗначение);
		УправлениеНебольшойФирмойКлиент.ПриИзмененииПериодаРегистрации(ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ВариантФильтраВыгрукиПриИзменении(Элемент)
	УстановитьВидимостьДат();
КонецПроцедуры
&НаСервере
Процедура УстановитьВидимостьДат()
	Элементы.Период.Видимость 				= ВариантФильтраВыгруки = 0 ИЛИ ВариантФильтраВыгруки = 2;
	Элементы.ПериодРегистрации.Видимость 	= ВариантФильтраВыгруки > 0;
КонецПроцедуры

&НаКлиенте
Функция ФильтрЗаполнен()
	РезультатПроверки = Истина;
	Если ВариантФильтраВыгруки = 0 Тогда
		Если НЕ ЗначениеЗаполнено(ДатаНач) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСТР("ru = 'Не указан ""Начало периода""!'; ka = 'არ არის შევსებული ველი ""პერიოდის დასაწყისი""!'; en = 'არ არის შევსებული ველი ""პერიოდის დასაწყისი""!'");
			Сообщение.Поле =  "ДатаНач";
			Сообщение.УстановитьДанные(Объект);
			Сообщение.Сообщить();
			РезультатПроверки = Ложь;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ДатаКон) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСТР("ru = 'Не указан ""Конец периода""!'; ka = 'არ არის შევსებული ველი ""პერიოდის დასასრული""!'; en = 'არ არის შევსებული ველი ""პერიოდის დასასრული""!'");
			Сообщение.Поле =  "ДатаКон";
			Сообщение.УстановитьДанные(Объект);
			Сообщение.Сообщить();
			РезультатПроверки = Ложь;
		КонецЕсли;
	ИначеЕсли ВариантФильтраВыгруки = 1 Тогда
		Если НЕ ЗначениеЗаполнено(Объект.ПериодРегистрации) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСТР("ru = 'Не указан ""Период регистрации""!'; ka = 'არ არის შევსებული ველი ""ოპერაციის თვე""!'; en = 'არ არის შევსებული ველი ""ოპერაციის თვე""!'");
			Сообщение.Поле =  "Объект.ПериодРегистрации";
			Сообщение.УстановитьДанные(Объект);
			Сообщение.Сообщить();
			РезультатПроверки = Ложь;
		КонецЕсли;
	Иначе
		Если НЕ ЗначениеЗаполнено(ДатаНач) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСТР("ru = 'Не указан ""Начало периода""!'; ka = 'არ არის შევსებული ველი ""პერიოდის დასაწყისი""!'; en = 'არ არის შევსებული ველი ""პერიოდის დასაწყისი""!'");
			Сообщение.Поле =  "ДатаНач";
			Сообщение.УстановитьДанные(Объект);
			Сообщение.Сообщить();
			РезультатПроверки = Ложь;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ДатаКон) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСТР("ru = 'Не указан ""Конец периода""!'; ka = 'არ არის შევსებული ველი ""პერიოდის დასასრული""!'; en = 'არ არის შევსებული ველი ""პერიოდის დასასრული""!'");
			Сообщение.Поле =  "ДатаКон";
			Сообщение.УстановитьДанные(Объект);
			Сообщение.Сообщить();
			РезультатПроверки = Ложь;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Объект.ПериодРегистрации) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСТР("ru = 'Не указан ""Период регистрации""!'; ka = 'არ არის შევსებული ველი ""ოპერაციის თვე""!'; en = 'არ არის შევსებული ველი ""ოპერაციის თვე""!'");
			Сообщение.Поле =  "Объект.ПериодРегистрации";
			Сообщение.УстановитьДанные(Объект);
			Сообщение.Сообщить();
			РезультатПроверки = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат РезультатПроверки;
	
КонецФункции
//_Паганини#Nexia
